jonahn/EE478/Lab2/PIC_SOURCES/h/p18f66j94.h
extern volatile far  unsigned char       ADCTMUEN1L;
extern volatile far  union {
  struct {
    unsigned CTMUEN:8;
  };
  struct {
    unsigned CTUMEN16:1;
    unsigned CTUMEN17:1;
    unsigned CTUMEN18:1;
    unsigned CTUMEN19:1;
    unsigned CTMUEN20:1;
    unsigned CTMUEN21:1;
    unsigned CTMUEN22:1;
    unsigned CTMUEN23:1;
  };
} ADCTMUEN1Lbits;
extern volatile far  unsigned char       ADCTMUEN1H;
extern volatile far  union {
  struct {
    unsigned CTMUEN:8;
  };
  struct {
    unsigned CTUMEN24:1;
    unsigned CTUMEN25:1;
    unsigned CTUMEN26:1;
    unsigned CTUMEN27:1;
    unsigned CTUMEN28:1;
    unsigned CTUMEN29:1;
    unsigned CTMUEN30:1;
  };
} ADCTMUEN1Hbits;
extern volatile far  unsigned char       ADCHIT0L;
extern volatile far  union {
  struct {
    unsigned CHH:8;
  };
  struct {
    unsigned CHH0:1;
    unsigned CHH1:1;
    unsigned CHH2:1;
    unsigned CHH3:1;
    unsigned CHH4:1;
    unsigned CHH5:1;
    unsigned CHH6:1;
    unsigned CHH7:1;
  };
} ADCHIT0Lbits;
extern volatile far  unsigned char       ADCHIT0H;
extern volatile far  union {
  struct {
    unsigned CHH:8;
  };
  struct {
    unsigned CHH8:1;
    unsigned CHH9:1;
    unsigned CHH10:1;
    unsigned CHH11:1;
    unsigned CHH12:1;
    unsigned CHH13:1;
    unsigned CHH14:1;
    unsigned CHH15:1;
  };
} ADCHIT0Hbits;
extern volatile far  unsigned char       ADCHIT1L;
extern volatile far  union {
  struct {
    unsigned CHH:8;
  };
  struct {
    unsigned CHH16:1;
    unsigned CHH17:1;
    unsigned CHH18:1;
    unsigned CHH19:1;
    unsigned CHH20:1;
    unsigned CHH21:1;
    unsigned CHH22:1;
    unsigned CHH23:1;
  };
} ADCHIT1Lbits;
extern volatile far  unsigned char       ADCHIT1H;
extern volatile far  union {
  struct {
    unsigned CHH:8;
  };
  struct {
    unsigned CHH24:1;
    unsigned CHH25:1;
    unsigned CHH26:1;
    unsigned CHH27:1;
    unsigned CHH28:1;
    unsigned CHH29:1;
    unsigned CHH30:1;
  };
} ADCHIT1Hbits;
extern volatile far  unsigned char       ADCSS0L;
extern volatile far  union {
  struct {
    unsigned CSS:8;
  };
  struct {
    unsigned CSS0:1;
    unsigned CSS1:1;
    unsigned CSS2:1;
    unsigned CSS3:1;
    unsigned CSS4:1;
    unsigned CSS5:1;
    unsigned CSS6:1;
    unsigned CSS7:1;
  };
} ADCSS0Lbits;
extern volatile far  unsigned char       ADCSS0H;
extern volatile far  union {
  struct {
    unsigned CSS:8;
  };
  struct {
    unsigned CSS8:1;
    unsigned CSS9:1;
    unsigned CSS10:1;
    unsigned CSS11:1;
    unsigned CSS12:1;
    unsigned CSS13:1;
    unsigned CSS14:1;
    unsigned CSS15:1;
  };
} ADCSS0Hbits;
extern volatile far  unsigned char       ADCSS1L;
extern volatile far  union {
  struct {
    unsigned CSS:8;
  };
  struct {
    unsigned CSS16:1;
    unsigned CSS17:1;
    unsigned CSS18:1;
    unsigned CSS19:1;
    unsigned CSS20:1;
    unsigned CSS21:1;
    unsigned CSS22:1;
    unsigned CSS23:1;
  };
} ADCSS1Lbits;
extern volatile far  unsigned char       ADCSS1H;
extern volatile far  union {
  struct {
    unsigned CSS:8;
  };
  struct {
    unsigned CSS24:1;
    unsigned CSS25:1;
    unsigned CSS26:1;
    unsigned CSS27:1;
    unsigned CSS28:1;
    unsigned CSS29:1;
    unsigned CSS30:1;
  };
} ADCSS1Hbits;
extern volatile far  unsigned char       ADCHS0L;
extern volatile far  union {
  struct {
    unsigned CH0SA:5;
    unsigned CH0NA:3;
  };
  struct {
    unsigned CH0SA0:1;
    unsigned CH0SA1:1;
    unsigned CH0SA2:1;
    unsigned CH0SA3:1;
    unsigned CH0SA4:1;
    unsigned CH0NA0:1;
    unsigned CH0NA1:1;
    unsigned CH0NA2:1;
  };
} ADCHS0Lbits;
extern volatile far  unsigned char       ADCHS0H;
extern volatile far  union {
  struct {
    unsigned CH0SB:5;
    unsigned CH0NB:3;
  };
  struct {
    unsigned CH0SB0:1;
    unsigned CH0SB1:1;
    unsigned CH0SB2:1;
    unsigned CH0SB3:1;
    unsigned CH0SB4:1;
    unsigned CH0NB0:1;
    unsigned CH0NB1:1;
    unsigned CH0NB2:1;
  };
} ADCHS0Hbits;
extern volatile far  unsigned char       ADCON5L;
extern volatile far  union {
  struct {
    unsigned CM:2;
    unsigned WM:2;
  };
  struct {
    unsigned CM0:1;
    unsigned CM1:1;
    unsigned WM0:1;
    unsigned WM1:1;
  };
} ADCON5Lbits;
extern volatile far  unsigned char       ADCON5H;
extern volatile far  union {
  struct {
    unsigned ASINTMD:2;
    unsigned :3;
    unsigned CTMUREQ:1;
    unsigned LPENA:1;
    unsigned ASENA:1;
  };
  struct {
    unsigned ASINTMD0:1;
    unsigned ASINTMD1:1;
  };
} ADCON5Hbits;
extern volatile far  unsigned char       ADCON3L;
extern volatile far  union {
  struct {
    unsigned ADCS:8;
  };
  struct {
    unsigned ADCS0:1;
    unsigned ADCS1:1;
    unsigned ADCS2:1;
    unsigned ADCS3:1;
    unsigned ADCS4:1;
    unsigned ADCS5:1;
    unsigned ADCS6:1;
    unsigned ADCS7:1;
  };
} ADCON3Lbits;
extern volatile far  unsigned char       ADCON3H;
extern volatile far  union {
  struct {
    unsigned SAMC:5;
    unsigned PUMPEN:1;
    unsigned EXTSAM:1;
    unsigned ADRC:1;
  };
  struct {
    unsigned SAMC0:1;
    unsigned SAMC1:1;
    unsigned SAMC2:1;
    unsigned SAMC3:1;
    unsigned SAMC4:1;
  };
} ADCON3Hbits;
extern volatile far  unsigned char       ADCON2L;
extern volatile far  union {
  struct {
    unsigned ALTS:1;
    unsigned BUFM:1;
    unsigned SMPI:5;
    unsigned BUFS:1;
  };
  struct {
    unsigned :2;
    unsigned SMPI0:1;
    unsigned SMPI1:1;
    unsigned SMPI2:1;
    unsigned SMPI3:1;
    unsigned SMPI4:1;
  };
} ADCON2Lbits;
extern volatile far  unsigned char       ADCON2H;
extern volatile far  union {
  struct {
    unsigned :2;
    unsigned CSCNA:1;
    unsigned BUFREGEN:1;
    unsigned OFFCAL:1;
    unsigned NVCFG0:1;
    unsigned PVCFG:2;
  };
  struct {
    unsigned :6;
    unsigned PVCFG0:1;
    unsigned PVCFG1:1;
  };
} ADCON2Hbits;
extern volatile far  unsigned char       LCDDATA0;
extern volatile far  struct {
  unsigned S00C0:1;
  unsigned S01C0:1;
  unsigned S02C0:1;
  unsigned S03C0:1;
  unsigned S04C0:1;
  unsigned S05C0:1;
  unsigned S06C0:1;
  unsigned S07C0:1;
} LCDDATA0bits;
extern volatile far  unsigned char       LCDDATA1;
extern volatile far  struct {
  unsigned S08C0:1;
  unsigned S09C0:1;
  unsigned S10C0:1;
  unsigned S11C0:1;
  unsigned S12C0:1;
  unsigned S13C0:1;
  unsigned S14C0:1;
  unsigned S15C0:1;
} LCDDATA1bits;
extern volatile far  unsigned char       LCDDATA2;
extern volatile far  struct {
  unsigned S16C0:1;
  unsigned S17C0:1;
  unsigned S18C0:1;
  unsigned S19C0:1;
  unsigned S20C0:1;
  unsigned S21C0:1;
  unsigned S22C0:1;
  unsigned S23C0:1;
} LCDDATA2bits;
extern volatile far  unsigned char       LCDDATA3;
extern volatile far  struct {
  unsigned S24C0:1;
  unsigned S25C0:1;
  unsigned S26C0:1;
  unsigned S27C0:1;
  unsigned S28C0:1;
  unsigned S29C0:1;
  unsigned S30C0:1;
  unsigned S31C0:1;
} LCDDATA3bits;
