jonahn/EE478/Lab2/PIC_SOURCES/h/p18f66j94.h
extern volatile far  unsigned char       DSCONH;
extern volatile far  struct {
  unsigned RTCWDIS:1;
  unsigned :6;
  unsigned DSEN:1;
} DSCONHbits;
extern volatile far  unsigned char       DSCONL;
extern volatile far  struct {
  unsigned RELEASE:1;
  unsigned DSBOR:1;
  unsigned ULPWDIS:1;
} DSCONLbits;
extern volatile far  unsigned char       TXREG3;
extern volatile far  unsigned char       RCREG3;
extern volatile far  unsigned char       SPBRG3;
extern volatile far  union {
  struct {
    unsigned SPBRG3:8;
  };
  struct {
    unsigned BRG0:1;
    unsigned BRG1:1;
    unsigned BRG2:1;
    unsigned BRG3:1;
    unsigned BRG4:1;
    unsigned BRG5:1;
    unsigned BRG6:1;
    unsigned BRG7:1;
  };
} SPBRG3bits;
extern volatile far  unsigned char       SPBRGH3;
extern volatile far  union {
  struct {
    unsigned SPBRGH3:8;
  };
  struct {
    unsigned BRG8:1;
    unsigned BRG9:1;
    unsigned BRG10:1;
    unsigned BRG11:1;
    unsigned BRG12:1;
    unsigned BRG13:1;
    unsigned BRG14:1;
    unsigned BRG15:1;
  };
} SPBRGH3bits;
extern volatile far  unsigned char       BAUDCON3;
extern volatile far  struct {
  unsigned ABDEN:1;
  unsigned WUE:1;
  unsigned IREN:1;
  unsigned BRG16:1;
  unsigned TXCKP:1;
  unsigned RXDTP:1;
  unsigned RCIDL:1;
  unsigned ABDOVF:1;
} BAUDCON3bits;
extern volatile far  unsigned char       TXSTA3;
extern volatile far  struct {
  unsigned TX9D:1;
  unsigned TRMT:1;
  unsigned BRGH:1;
  unsigned SENDB:1;
  unsigned SYNC:1;
  unsigned TXEN:1;
  unsigned TX9:1;
  unsigned CSRC:1;
} TXSTA3bits;
extern volatile far  unsigned char       RCSTA3;
extern volatile far  struct {
  unsigned RX9D:1;
  unsigned OERR:1;
  unsigned FERR:1;
  unsigned ADDEN:1;
  unsigned CREN:1;
  unsigned SREN:1;
  unsigned RX9:1;
  unsigned SPEN:1;
} RCSTA3bits;
extern volatile far  unsigned char       SPBRGH;
extern volatile far  union {
  struct {
    unsigned SPBRGH1:8;
  };
  struct {
    unsigned BRG8:1;
    unsigned BRG9:1;
    unsigned BRG10:1;
    unsigned BRG11:1;
    unsigned BRG12:1;
    unsigned BRG13:1;
    unsigned BRG14:1;
    unsigned BRG15:1;
  };
} SPBRGHbits;
extern volatile far  unsigned char       SPBRGH1;
extern volatile far  union {
  struct {
    unsigned SPBRGH1:8;
  };
  struct {
    unsigned BRG8:1;
    unsigned BRG9:1;
    unsigned BRG10:1;
    unsigned BRG11:1;
    unsigned BRG12:1;
    unsigned BRG13:1;
    unsigned BRG14:1;
    unsigned BRG15:1;
  };
} SPBRGH1bits;
extern volatile far  unsigned char       BAUDCON2;
extern volatile far  struct {
  unsigned ABDEN:1;
  unsigned WUE:1;
  unsigned IREN:1;
  unsigned BRG16:1;
  unsigned TXCKP:1;
  unsigned RXDTP:1;
  unsigned RCIDL:1;
  unsigned ABDOVF:1;
} BAUDCON2bits;
extern volatile far  unsigned char       TXSTA2;
extern volatile far  struct {
  unsigned TX9D:1;
  unsigned TRMT:1;
  unsigned BRGH:1;
  unsigned SENDB:1;
  unsigned SYNC:1;
  unsigned TXEN:1;
  unsigned TX9:1;
  unsigned CSRC:1;
} TXSTA2bits;
extern volatile far  unsigned char       RCSTA2;
extern volatile far  struct {
  unsigned RX9D:1;
  unsigned OERR:1;
  unsigned FERR:1;
  unsigned ADDEN:1;
  unsigned CREN:1;
  unsigned SREN:1;
  unsigned RX9:1;
  unsigned SPEN:1;
} RCSTA2bits;
extern volatile far  unsigned char       CCPTMRS2;
extern volatile far  union {
  struct {
    unsigned C8TSEL:2;
    unsigned C9TSEL:1;
    unsigned :1;
    unsigned C10TSEL:1;
  };
  struct {
    unsigned C8TSEL0:1;
    unsigned C8TSEL1:1;
    unsigned C9TSEL0:1;
    unsigned :1;
    unsigned C10TSEL0:1;
  };
} CCPTMRS2bits;
extern volatile far  unsigned char       CCPTMRS1;
extern volatile far  union {
  struct {
    unsigned C4TSEL:2;
    unsigned C5TSEL:1;
    unsigned :1;
    unsigned C6TSEL:1;
    unsigned :1;
    unsigned C7TSEL:2;
  };
  struct {
    unsigned C4TSEL0:1;
    unsigned C4TSEL1:1;
    unsigned C5TSEL0:1;
    unsigned :1;
    unsigned C6TSEL0:1;
    unsigned :1;
    unsigned C7TSEL0:1;
    unsigned C7TSEL1:1;
  };
} CCPTMRS1bits;
extern volatile far  unsigned char       CCPTMRS0;
extern volatile far  union {
  struct {
    unsigned C1TSEL:3;
    unsigned C2TSEL:3;
    unsigned C3TSEL:2;
  };
  struct {
    unsigned C1TSEL0:1;
    unsigned C1TSEL1:1;
    unsigned C1TSEL2:1;
    unsigned C2TSEL0:1;
    unsigned C2TSEL1:1;
    unsigned C2TSEL2:1;
    unsigned C3TSEL0:1;
    unsigned C3TSEL1:1;
  };
} CCPTMRS0bits;
extern volatile far  unsigned char       CM3CON;
extern volatile far  union {
  struct {
    unsigned CCH:2;
    unsigned CREF:1;
    unsigned EVPOL:2;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned CON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :1;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
} CM3CONbits;
extern volatile far  unsigned char       CM2CON;
extern volatile far  union {
  struct {
    unsigned CCH:2;
    unsigned CREF:1;
    unsigned EVPOL:2;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned CON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :1;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
} CM2CONbits;
extern volatile far  unsigned char       SSP2CON3;
extern volatile far  struct {
  unsigned DHEN:1;
  unsigned AHEN:1;
  unsigned SBCDE:1;
  unsigned SDAHT:1;
  unsigned BOEN:1;
  unsigned SCIE:1;
  unsigned PCIE:1;
  unsigned ACKTIM:1;
} SSP2CON3bits;
extern volatile far  unsigned char       T8CON;
extern volatile far  union {
  struct {
    unsigned T8CKPS:2;
    unsigned TMR8ON:1;
    unsigned T8OUTPS:4;
  };
  struct {
    unsigned T8CKPS0:1;
    unsigned T8CKPS1:1;
    unsigned :1;
    unsigned T8OUTPS0:1;
    unsigned T8OUTPS1:1;
    unsigned T8OUTPS2:1;
    unsigned T8OUTPS3:1;
  };
} T8CONbits;
extern volatile far  unsigned char       PR8;
extern volatile far  unsigned char       TMR8;
extern volatile far  unsigned char       T6CON;
extern volatile far  union {
  struct {
    unsigned T6CKPS:2;
    unsigned TMR6ON:1;
    unsigned T6OUTPS:4;
  };
  struct {
    unsigned T6CKPS0:1;
    unsigned T6CKPS1:1;
    unsigned :1;
    unsigned T6OUTPS0:1;
    unsigned T6OUTPS1:1;
    unsigned T6OUTPS2:1;
    unsigned T6OUTPS3:1;
  };
} T6CONbits;
